doc/apostrofoj.org
# -*- org-use-sub-superscripts: {}; -*-
#+OPTIONS: ^:{}
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="this.css" />
#+title: Pri apostrofoj kaj citiloj en Esperanto
#+LANGUAGE: eo

Ĉi tiu noto estas argumentaro por la maniero trakti la apostrofojn en
la projekto [[https://github.com/pok49/ispell-eo][ispell-eo]] (Esperanta vortaro por la literumilo [[https://en.wikipedia.org/wiki/Ispell][Ispell]]).

#+TOC: headlines 3

* Uzo de apostrofoj en diversaj lingvoj
Per si mem, lingve, en la propra tradicia Esperanto, la apostrofoj
prezentas nenian problemon. Sed en la reala vivo necesas atenti la
apartaĵojn de programaro verkita por aliaj lingvoj, precipe por la
angla, kiun programaron multaj esperantistoj praktike uzadas.

** En Esperanto
La programara problemo koncernas la vortolimojn: ĉu apostrofon
literumilo enprenu kiel parton de vorto – aŭ traktu ĝin kiel disigan
signon interpunkcian? En Esperanto la apostrofo estas traktenda kiel
vorta ero, simile al la literoj. Alie la apostrofitaj vortoj, tiom
oftaj en poezio, kaŭzos falsajn erarraportojn. Ekz‑e kontrolante la
verson:
#+begin_quote
en nova formʼ eksonis nova kantʼ
#+end_quote
la literumilo devas apartigi la vortojn ‹formʼ› kaj ‹kantʼ› kune kun
ilia apostrofo; la nudaj ‹form› kaj ‹kant› ne estas akcepteblaj. En
la tekstoprilaboraj programoj Esperantaj apostrofo traktendas kiel
speco de litero.

<<fra>>
** France
France (kaj en aliaj lingvoj latinidaj) oni rajtas rigardi apostrofon
kiel disigilon (unu el la signoj interpunkciaj), apartigantan
leksikajn unuojn, ekz‑e artikolon disde la rilata vorto:
#+begin_quote
/le/ + /enfant/ → /l’enfant/.
#+end_quote
Tio oportunas ekz‑e ĉe legado de franca teksto: duobla alklako sur
/l’enfant/ apartigas nur ‹enfant›, kio faciligas konsulton de traduka aŭ
sencodifina vortaro.

Ŝajnas ke ĉi tiu simpla traktado povus faciligi tekstoprilaboradon,
ekz‑e redukti la literumilajn vortarojn; tamen tiucele ankaŭ por la
franca lingvo utilas trakti apostrofon kiel vorteron, ĉar tio ebligas
kontroli multajn erarajn formojn, kiaj +/l’enfants/+, +/l’anciens/+
(plurnombre elizio ne okazas: /les enfants, les anciens/),
+/s’être/+ (kp /s’asseoir/), +/presqu/+ (kp /presqu’île/) ktp.[fn:ifr]

En la literatura lingvo la apostrofo aperas ĉiam vortomeze, inter
literoj, kvankam en imitado de malzorga prononco aŭ ĵargono eblas
ankaŭ la vortofina pozicio (kiel en Esperanto):@@html:<span lang="fr">@@
/pauv’ con/ @@html:</span>@@(anstataŭ@@html:<span lang="fr">@@
/pauvre con/).@@html:</span>@@

** Angle
En la angla lingvo okazas kolizio inter ortografio kaj interpunkcio:
la apostrofo estas uzata de ambaŭ malsammaniere.

Ortografie la apostrofo estas *parto de vorto*, kiel en la franca:
/boy’s, doesn’t, we’ll, you’re, o’er …/ Apostrofo regule aperas
finvorte en la poseda formo post /s/, ekz‑e /ladiesʼ hats/. Malpli
ofte aperas apostrofo vortkomenca:
#+begin_quote
/'Tis the last rose of summer .../
#+end_quote
Interpunkcie la apostrofo estas uzata kiel disigilo, *signo nevorta*,
kiel ferma citilo (kaj en la prezento tajpa aŭ Askia, ankaŭ kiel
citilo malferma).

Por solvi tiun kolizion en la anglalingva literumado oni traktas la
signon ‹'› kiel apostrofon (do, vorteron) el la pozicioj interliteraj
(/isn't/ ktp), kaj kiel disigilon en la okazoj ceteraj. Tio ne kaŭzas
problemojn en la posedaj formoj (kia /ladies'/), ĉar la antaŭapostrofa
bazo ja estas (devas esti) regula vorto angla; la problemo restas ĉe
la komencvorta apostrofo (kia /ʼtis/) – sed tiaj vortoj estas
maloftaj, kaj ofte koincidas kun aliaj anglaj vortoj: /ʼbout/ (el
/about/) koincidas kun /bout; 'less/ (el /unless/) koincidas kun
/less/ ktp. Kompreneble ĉi tiu elturniĝo ne prosperas en Esperanto,
krom esceptokaze; ekz‑e ĉe la nevortaj apostrofoj ‹’› (U+2019) en la
/Hamleta/ verso
#+begin_quote
De l’ ter’ al la ĉiel’ ĝi laŭte krias
#+end_quote
iuj literumiloj plendas pri ‹ter›, sed akceptas ‹ĉiel›.
* Pri la citiloj
La Esperantaj tekstoj ekzistas en 3 formoj: manskriba, tipografia, tajpa.
En la frua periodo ĉefis la du unuaj; de post la Unua  Mondmilito kaj
ĝis 1980-aj jaroj ĉefis la tajpiloj; poste kaj ĝis nun plej gravas la
prezentoj komputilaj, kiuj per la sortimento da disponeblaj signoj
egalas aŭ eĉ superas la iaman tipografion. Ĝuste la komputilaj
prezentoj precipe interesas nin ĉi tie; tamen ili ja evoluis el la
tipografiaj, kaj ilin forte influis la tradicio tajpada. Fakte la
tajpado plu influas, ĉar Askio kaj la klavaroj ja esence restas tajpilaj.

Zamenhofo ne opiniis la formon de citiloj grava trajto de la
lingvo. En la Fundamenta Ekzercaro aperas 3 citilaj paroj, sen
ia ajn sencodistingo:

„ “ – (ĵargone nomata «99—66») – 26-foje;\\
« » – (duoblaj angulaj citiloj) – 8-foje, plus 12 aperoj en la
/Antaŭparolo/, sume 20-foje;\\
“ ” – (ĵargone nomata «66—99») – 20-foje.

La arbitrecon kaj samsignifecon de la uzoj klare ilustras «La feino»,
fabelo dispartigita inter §§ 11, 13–15, 17, 19, 21 kaj 23: komence
(ekde §15) la dialogajn dirojn markas “…”; sed en §21, «…». Mi dubas,
ke tiu malordo estas sekvo de konscia miksado. (Al mi mankas faktoj,
sed mi supozas, ke preparante iun eldonon de la /Ekzercaro/ Zamenhofo
kungluis pecojn el diversaj pli fruaj eldonoj, kompostitaj laŭ diversaj
tipografiaj kutimoj.)

Plue, en la teksto de FE disponebla [[https://www.akademio-de-esperanto.org/fundamento/ekzercaro.html][en la Akademia retejo]] oni trovas
ĉiujn 3 citilajn specojn, sed ne ĉiam en tiuj lokoj, kie ili aperas en
la papera eldono de la 1905ª jaro.

Kvankam tio ne rilatas al la tradicio de Esperanto, tamen notindas
ankoraŭ unu strangaĵo de la Fundamento: la gramatiketo ruslingva havas
la germanajn citilojn 99—66:
#+begin_quote
*13.* На вопросъ „куда“ … -- p. 20

*15.* Такъ называемыя „иностранныя“ слова … -- p. 21
#+end_quote
dum en la teksto pollingva aperas la angulaj citiloj francaj:
#+begin_quote
*13.* Na pytanie « dokąd » …

*15.* Tak zwanie « wyrazy cudzoziemskie » … -- p. 25
#+end_quote
kvankam la ĉefformoj de la citiloj en tiuj du lingvoj estas (almenaŭ
nun) ĝuste inversaj: «ruse» kaj „pole“.

Racia elekto de citiloj preferindaj en Esperanto devas atenti la
eblon de vortofinaj apostrofoj. Komparu la prezentojn de frazo el FE
§27:

1. Anstataŭ «la» oni povas ankaŭ diri «lʼ»
2. Anstataŭ „la“ oni povas ankaŭ diri „lʼ“
3. Anstataŭ “la” oni povas ankaŭ diri “lʼ”.

Por mi, (1) estas la plej bona kaj klara; tamen Zamenhofo ial uzis
ĉi-okaze la formon (2), malpli klaran, sed ankoraŭ legeblan; la formon
(3) mi opinias maltaŭga. Tamen ĝuste ĝin preferas PIV, «Esperanto»,
«La Ondo de Esperanto».

En diversaj landoj la kurbaj citiloj “x” estas manskriba rondigita
varianto de la angulaj citiloj «x» tipografiaj; kaj la kurbaj citiloj
„x“ estas rondigita formo de la »internen montrantaj« citiloj, kutimaj
en la interpunkcio germana. La formoj «x» kaj „x“ estas tradiciaj en
Esperanto; la formo »x« estas maloftega kaj nenorma.

Estas ankoraŭ unu speco, uzata i.a. de «Monato»: „x” (99—99)[fn:PP]. Ĝi ne
estas tradicia, ĝi ne aperas en la Fundamento; kaj ĝi estas same aĉa,
kiel la formo 66—99, ĉar ambaŭ formoj havas la saman ferman citilon,
ĝene gluiĝantan al eventuala apostrofo: „l’”.

