doc/apostrofoj.md
# Pri apostrofoj kaj citiloj en Esperanto

Ĉi tiu noto estas argumentaro por la maniero trakti la apostrofojn en
la projekto [ispell-eo](https://github.com/pok49/ispell-eo) (Esperanta vortaro por la literumilo [Ispell](https://en.wikipedia.org/wiki/Ispell)).


## Enhavo

1.  [Uzo de apostrofoj en diversaj lingvoj](#org7b8c48a)
    1.  [En Esperanto](#org08f6062)
    2.  [France](#orgebbe088)
    3.  [Angle](#org1e936d3)
2.  [Pri la citiloj](#org750c220)
    1.  [Citaĵo en citaĵo](#orgacd9991)
    2.  [Memreprezentaĵoj kaj sencodifinoj](#orgbd95464)
    3.  [La rekta parolo](#org8feba5c)
        1.  [La maniero franca-pola-rusa](#org8e3fa17)
        2.  [La maniero ĝermana (angla-germana)](#orge834881)
        3.  [Aliaj signoj similaj](#org3af6513)
3.  [Kodoj](#org72ada1b)
    1.  [Tajpiloj kaj Askio](#org9ffc3ca)
    2.  [La 8-bitaj kodoj](#org382391a)
    3.  [Unikodo](#orge60b253)
    4.  [WGL4](#orgd4a624e)
    5.  [Vikipedio](#org65e69d9)
4.  [Komparo de literumiloj](#orgbf777cd)
    1.  [Ispell](#org0b15f28)
        1.  [La Emaksa interfaco](#orgb5ab6c6)
    2.  [GNU Aspell](#orgab9cb9a)
    3.  [Hunspell](#orgb47b992)
    4.  [Vim](#org6359cdc)
5.  [Konkludo](#orgee45095)


<a id="org7b8c48a"></a>

# Uzo de apostrofoj en diversaj lingvoj

Per si mem, lingve, en la propra tradicia Esperanto, la apostrofoj
prezentas nenian problemon. Sed en la reala vivo necesas atenti la
apartaĵojn de programaro verkita por aliaj lingvoj, precipe por la
angla, kiun programaron multaj esperantistoj praktike uzadas.


<a id="org08f6062"></a>

## En Esperanto

La programara problemo koncernas la vortolimojn: ĉu apostrofon
literumilo enprenu kiel parton de vorto – aŭ traktu ĝin kiel disigan
signon interpunkcian? En Esperanto la apostrofo estas traktenda kiel
vorta ero, simile al la literoj. Alie la apostrofitaj vortoj, tiom
oftaj en poezio, kaŭzos falsajn erarraportojn. Ekz‑e kontrolante la
verson:

> en nova formʼ eksonis nova kantʼ

la literumilo devas apartigi la vortojn ‹formʼ› kaj ‹kantʼ› kune kun
ilia apostrofo; la nudaj ‹form› kaj ‹kant› ne estas akcepteblaj. En
la tekstoprilaboraj programoj Esperantaj apostrofo traktendas kiel
speco de litero.

<a id="org8a54e4f"></a>


<a id="orgebbe088"></a>

## France

France (kaj en aliaj lingvoj latinidaj) oni rajtas rigardi apostrofon
kiel disigilon (unu el la signoj interpunkciaj), apartigantan
leksikajn unuojn, ekz‑e artikolon disde la rilata vorto:

> *le* + *enfant* → *l’enfant*.

Tio oportunas ekz‑e ĉe legado de franca teksto: duobla alklako sur
*l’enfant* apartigas nur ‹enfant›, kio faciligas konsulton de traduka aŭ
sencodifina vortaro.

Ŝajnas ke ĉi tiu simpla traktado povus faciligi tekstoprilaboradon,
ekz‑e redukti la literumilajn vortarojn; tamen tiucele ankaŭ por la
franca lingvo utilas trakti apostrofon kiel vorteron, ĉar tio ebligas
kontroli multajn erarajn formojn, kiaj <del>*l’enfants*</del>, <del>*l’anciens*</del>
(plurnombre elizio ne okazas: *les enfants, les anciens*),
<del>*s’être*</del> (kp *s’asseoir*), <del>*presqu*</del> (kp *presqu’île*) ktp.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>

En la literatura lingvo la apostrofo aperas ĉiam vortomeze, inter
literoj, kvankam en imitado de malzorga prononco aŭ ĵargono eblas
ankaŭ la vortofina pozicio (kiel en Esperanto):<span lang="fr">
*pauv’ con* </span>(anstataŭ<span lang="fr">
*pauvre con*).</span>


<a id="org1e936d3"></a>

## Angle

En la angla lingvo okazas kolizio inter ortografio kaj interpunkcio:
la apostrofo estas uzata de ambaŭ malsammaniere.

Ortografie la apostrofo estas **parto de vorto**, kiel en la franca:
*boy’s, doesn’t, we’ll, you’re, o’er …* Apostrofo regule aperas
finvorte en la poseda formo post *s*, ekz‑e *ladiesʼ hats*. Malpli
ofte aperas apostrofo vortkomenca:

> *'Tis the last rose of summer &#x2026;*

Interpunkcie la apostrofo estas uzata kiel disigilo, **signo nevorta**,
kiel ferma citilo (kaj en la prezento tajpa aŭ Askia, ankaŭ kiel
citilo malferma).

Por solvi tiun kolizion en la anglalingva literumado oni traktas la
signon ‹'› kiel apostrofon (do, vorteron) el la pozicioj interliteraj
(*isn't* ktp), kaj kiel disigilon en la okazoj ceteraj. Tio ne kaŭzas
problemojn en la posedaj formoj (kia *ladies'*), ĉar la antaŭapostrofa
bazo ja estas (devas esti) regula vorto angla; la problemo restas ĉe
la komencvorta apostrofo (kia *ʼtis*) – sed tiaj vortoj estas
maloftaj, kaj ofte koincidas kun aliaj anglaj vortoj: *ʼbout* (el
*about*) koincidas kun *bout; 'less* (el *unless*) koincidas kun
*less* ktp. Kompreneble ĉi tiu elturniĝo ne prosperas en Esperanto,
krom esceptokaze; ekz‑e ĉe la nevortaj apostrofoj ‹’› (U+2019) en la
*Hamleta* verso

> De l’ ter’ al la ĉiel’ ĝi laŭte krias

iuj literumiloj plendas pri ‹ter›, sed akceptas ‹ĉiel›.


<a id="org750c220"></a>

# Pri la citiloj

La Esperantaj tekstoj ekzistas en 3 formoj: manskriba, tipografia, tajpa.
En la frua periodo ĉefis la du unuaj; de post la Unua  Mondmilito kaj
ĝis 1980-aj jaroj ĉefis la tajpiloj; poste kaj ĝis nun plej gravas la
prezentoj komputilaj, kiuj per la sortimento da disponeblaj signoj
egalas aŭ eĉ superas la iaman tipografion. Ĝuste la komputilaj
prezentoj precipe interesas nin ĉi tie; tamen ili ja evoluis el la
tipografiaj, kaj ilin forte influis la tradicio tajpada. Fakte la
tajpado plu influas, ĉar Askio kaj la klavaroj ja esence restas tajpilaj.

Zamenhofo ne opiniis la formon de citiloj grava trajto de la
lingvo. En la Fundamenta Ekzercaro aperas 3 citilaj paroj, sen
ia ajn sencodistingo:

„ “ – (ĵargone nomata «99—66») – 26-foje;  
« » – (duoblaj angulaj citiloj) – 8-foje, plus 12 aperoj en la
*Antaŭparolo*, sume 20-foje;  
“ ” – (ĵargone nomata «66—99») – 20-foje.

La arbitrecon kaj samsignifecon de la uzoj klare ilustras «La feino»,
fabelo dispartigita inter §§ 11, 13–15, 17, 19, 21 kaj 23: komence
(ekde §15) la dialogajn dirojn markas “…”; sed en §21, «…». Mi dubas,
ke tiu malordo estas sekvo de konscia miksado. (Al mi mankas faktoj,
sed mi supozas, ke preparante iun eldonon de la *Ekzercaro* Zamenhofo
kungluis pecojn el diversaj pli fruaj eldonoj, kompostitaj laŭ diversaj
tipografiaj kutimoj.)

Plue, en la teksto de FE disponebla [en la Akademia retejo](https://www.akademio-de-esperanto.org/fundamento/ekzercaro.html) oni trovas
ĉiujn 3 citilajn specojn, sed ne ĉiam en tiuj lokoj, kie ili aperas en
la papera eldono de la 1905ª jaro.

Kvankam tio ne rilatas al la tradicio de Esperanto, tamen notindas
ankoraŭ unu strangaĵo de la Fundamento: la gramatiketo ruslingva havas
la germanajn citilojn 99—66:

> **13.** На вопросъ „куда“ … &#x2013; p. 20
> 
> **15.** Такъ называемыя „иностранныя“ слова … &#x2013; p. 21

dum en la teksto pollingva aperas la angulaj citiloj francaj:

> **13.** Na pytanie « dokąd » …
> 
> **15.** Tak zwanie « wyrazy cudzoziemskie » … &#x2013; p. 25

kvankam la ĉefformoj de la citiloj en tiuj du lingvoj estas (almenaŭ
nun) ĝuste inversaj: «ruse» kaj „pole“.

Racia elekto de citiloj preferindaj en Esperanto devas atenti la
eblon de vortofinaj apostrofoj. Komparu la prezentojn de frazo el FE
§27:

1.  Anstataŭ «la» oni povas ankaŭ diri «lʼ»
2.  Anstataŭ „la“ oni povas ankaŭ diri „lʼ“
3.  Anstataŭ “la” oni povas ankaŭ diri “lʼ”.

Por mi, (1) estas la plej bona kaj klara; tamen Zamenhofo ial uzis
ĉi-okaze la formon (2), malpli klaran, sed ankoraŭ legeblan; la formon
(3) mi opinias maltaŭga. Tamen ĝuste ĝin preferas PIV, «Esperanto»,
«La Ondo de Esperanto».

En diversaj landoj la kurbaj citiloj “x” estas manskriba rondigita
varianto de la angulaj citiloj «x» tipografiaj; kaj la kurbaj citiloj
„x“ estas rondigita formo de la »internen montrantaj« citiloj, kutimaj
en la interpunkcio germana. La formoj «x» kaj „x“ estas tradiciaj en
Esperanto; la formo »x« estas maloftega kaj nenorma.

Estas ankoraŭ unu speco, uzata i.a. de «Monato»: „x” (99—99)<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. Ĝi ne
estas tradicia, ĝi ne aperas en la Fundamento; kaj ĝi estas same aĉa,
kiel la formo 66—99, ĉar ambaŭ formoj havas la saman ferman citilon,
ĝene gluiĝantan al eventuala apostrofo: „l’”.
