doc/apostrofoj.org
** Citaĵo en citaĵo
Plureco de la citilaj specoj utilas okaze de citaĵoj enmetitaj en
citaĵon. Estas kiel pri la krampoj en la matematikaj formuloj: la esprimo
: 7 – {[(10 – 6) × 5] + 13}
legeblas pli facile ol
: 7 – (((10 – 6) × 5) + 13)

Ho ve, allasinte plurajn citilajn formojn, Zamenhofo ne profitis la
eblojn kiujn tio donas. Ekz‑e en sia traduko de «La batalo de l' vivo»
(1891):
#+begin_quote
„aldonu ankoraŭ la vortojn „kaj fingringo“, kaj mi volas la ambaŭ
sentencojn pendigi en la loĝejo anstataŭ la portreto de mia mastrino.“
#+end_quote
Ĉu Zamenhofo malvolis kompliki la lingvon?

Ĉiel ajn, en la reeldono de «La batalo», serioze reviziita de la
britaj editoroj, la citiloj estas diferencigitaj (kio estas bona), sed
por la internaj citiloj estas uzataj la anglaj kurbaj citiloj unuoblaj 6-9
(kio estas bedaŭrinda):
#+begin_quote
“Dio nin gardu de tio ĉi! Ŝi vivu kaj … poste ŝi diru kun tiu franco:
‘La komedio estas finita, faligu la kurtenon.’”
#+end_quote
Nuntempe kiam la komputiloj elskatole disponigas riĉegan sortimenton da
signoj, kaj inter ili ĉiujn citilojn Fundamentajn, estas neracie uzi
la konfuzajn apostrofajn citilojn. En la [[http://kovro.heliohost.org/books/la_batalo/batalof.html][moderna revizio]] de la
«Batalo» tiu ekzemplo havas do la formon:
#+begin_quote
«Dio nin gardu de tio ĉi! Ŝi vivu kaj ridadu pri tio ĉi kiel longe ŝi
povas ridi, kaj poste ŝi diru kun tiu franco: „La komedio estas
finita, faligu la kurtenon.“»
#+end_quote
Simila kungluiĝo povas okazi ankaŭ komence de la ekstera citaĵo, kaj
ankaŭ ĉi-okaze la sammaniera malambiguigo egale klaras:
#+begin_quote
«„Faru ion al la homoj, por ke ili nenion al vi faru“, vi kredeble
pensas?» diris sinjoro Snitchey.
#+end_quote
(kp “‘Faru … al vi faru’ …”).

La Unikoda normo rekomendas unuoblajn angulajn citilojn por la
internaj citaĵoj[fn:g1]; tamen ene de la duoblaj angulaj citiloj tio
estas same konfuza, kiel la anglaj apostrofaj citiloj ene de la
duoblaj anglaj citiloj kurbaj. Por facila distingeblo la internaj
citiloj devas esti alispecaj ol la eksteraj.

** Memreprezentaĵoj kaj sencodifinoj
Aparta uzo de la citiloj estas marki memreprezentaĵojn (aŭtonimojn), t.e.
tiajn uzojn de vortoj aŭ aliaj signoj, en kiuj ili reprezentas ne la
/signaton/, sed la /signanton/, t.e. sin mem. Tiaj uzoj oftas en
lingvoscienco, kaj plurajn ekzemplojn disponigas la /Fundamenta
Ekzercaro/ (FE):
#+begin_quote
... tiel same ni ankaŭ diras: „la birdo flugis en la ĝardenon, sur la
tablon“, kaj la vortoj „ĝardenon“, „tablon“ staras tie ĉi en akuzativo
ne ĉar la prepozicioj „en“ kaj „sur“ tion ĉi postulas, sed nur ĉar
ni volis esprimi direkton ... — FE §28
#+end_quote
#+begin_quote
La sufikso «um» ne havas difinitan signifon. -- FE §42.
#+end_quote
Zamenhofo neniam apartigis ĉi tian uzon de la citiloj; sed en fakaj
tekstoj lingvosciencaj oni ofte uzas tiucele la anglajn citilojn
apostrofajn: ‘ĝardenon’, ‘tablon’, ‘sur’...

Tio estas konfuza kaj maloportuna. Mi koncedas, ke la duoblaj
citiloj ĉirkaŭ mallonga vorto aŭ unuopa signo povas impresi kiel io
peza, iom grandioza; sed ĝenerale disponeblaj estas la unuoblaj angulaj
citiloj ‹x›, kiuj aspektas sufiĉe modeste kaj estas malambiguaj. Kp:
#+begin_quote
Anstataŭ ‘la’ oni povas ankaŭ diri ‘lʼ’\\
Anstataŭ ‹la› oni povas ankaŭ diri ‹lʼ›.
#+end_quote
#+begin_quote
La tajpila-Askia apostrofo ‹'› povas reprezenti
- la apostrofajn citilojn (la malferman ‹‘› aŭ la ferman ‹’›),
- proprasencan apostrofon ‹ʼ›,
- minutsignon ‹′›,
- dekstran kornon ‹′› ...
#+end_quote
En la anglaj apostrofaj citiloj tia frazo estas malfacile legebla
(resp. ‘'’, ‘‘’, ‘ʼ’, ‘’’, ‘′’, ‘′’), kaj tute prave la franca
Vikipedio uzas la unuoblajn angulajn citilojn en la koncernaj partoj de
la artikolo «[[https://fr.wikipedia.org/wiki/Apostrophe_(typographie)#Ambigu%C3%AFt%C3%A9s][Apostrophe (typographie)]]». Kaj ankaŭ ĉe la malsupraj signoj la
apostrofaj citiloj aspektas aĉe: punkto ‘.’; zoeto ‘¸’ – pli klaras  ‹.›,  ‹¸›.

Tiusence anstataŭ la citilojn oni ankaŭ uzas kursivon.

Alia lingvista uzo de la apostrofaj citiloj estas apartigi
sencodifinojn. Jen ekzemplo kie memreprezentaĵo aperas kursive, kaj
sencodifinoj, en citiloj. Ankaŭ ĉi-okaze uzeblas unuoblaj angulaj citiloj[fn:BW]:
#+begin_quote
/ruĝi/ = ‘esti ruĝa, impresi ruĝe’, sed nepre ne ‘igi ruĝa’ nek ‘iĝi ruĝa’\\
/ruĝi/ = ‹esti ruĝa, impresi ruĝe›, sed nepre ne ‹igi ruĝa› nek ‹iĝi ruĝa›
#+end_quote
Probable tiuj estas la solaj iom internaciaj uzoj de la apostrofaj citiloj.
** La rekta parolo
Unu el la ĉefaj funkcioj de la citiloj estas prezenti la rektan
parolon. Estas 2 specoj de rekta parolo: monologo kaj
dialogo. Monologon oni plejparte encitiligas; sed pri dialogoj la
naciaj (kaj sekve ankaŭ la Esperantaj) tradicioj varias.

En Esperanto kunekzistas du manieroj prezenti dialogojn: la ĝermana
kaj la franca-pola-rusa. Zamenhofo uzadis jen unu, jen la alian.

*** La maniero franca-pola-rusa

En ĉi tiu maniero dialogo estas konceptata ne kiel pluro da monologoj,
sed kiel aparta speco de parol-agado. Ĉiu eldiro komencas novan
alineon kaj estas antaŭata de haltostreko:
#+begin_quote
– Estimata sinjorino kredeble havas bezonon al la informa oficejo? –
diris la mastrino de la loĝejo.

– Jes, sinjorino, – respondis la venintino. – Mi estas Marta Świcka.

– Volu sidiĝi kaj atendi momenton, ĝis mi finos la interparoladon kun
tiuj sinjorinoj, kiuj venis antaŭe. -- («Marta»)
#+end_quote
<<Bazarov>>
Tiu aparta interpunkcio ebligas, interalie, klare diferencigi la
dialogon (la eldirojn eksterigatajn) disde la paralela monologo interna
(rekta parolo enmensa), ekz‑e
#+begin_quote
– Vi estas tre modesta … Sed mi dezirus ekscii ion pri vi, pri via
familio, pri via patro, pro kiu vi forlasas nin.

«Kial ŝi diras tion al mi?» – pensis Bazarov.

– Ĉio ĉi tute ne estas interesa, – diris li voĉe, – precipe por vi, ni
estas malaltaj homoj … («Patroj kaj filoj», ĉap. 17ª)[fn:PkF]
#+end_quote
Ankaŭ la eningita rekta parolo apektas pli bone:
#+begin_quote
– Efektive, okulfrapis, kiam mi vidis lin post tiu travivaĵo, lia
mirinda sereneco. Li diris: «Mia animo similas vastan trankvilan
lagon». Ĉu vi iam aŭdis pri iu, kiu, en unu tago, transiris el
plej profunda deprimiĝo en perfektan serenecon kun plena malapero
de ĉiuj psikaj simptomoj?[fn:Tien] 
#+end_quote
Similaj ekzemploj troveblas ekz‑e ankaŭ en la Zamenhofa traduko de «Marta».

*Noto.* En la cirilalfabeta tipografio oni markas la dialogojn per
haltostrekoj 0.8 em longaj – pli longaj, ol la angla N-streko
(/en-dash/, 0.5 em), sed ne tiom grandiozaj, kiel la angla /M-dash/
(1 em). Bedaŭrinde, Unikodo kaj plimulto da tiparoj disponigas nur la
anglajn haltostrekojn. En la ĉi-supraj ekzemploj mi uzis N-strekojn
(U+2013).

*** La maniero ĝermana (angla-germana)
En tiu maniero dialogo aperas kiel simpla sinsekvo da rektaj paroloj
monologaj, ĉiu el kiuj komencas apartan alineon:
#+begin_quote
„Ĉu vi ion vidis, Britain? ion aŭdis?“

„Estas tro mallume, por povi malproksime vidi, kaj tro multe da bruo
en la domo, por povi ion aŭdi“, respondis la servanto.

„Tio ĉi estas vera! Tiom pli gaja estos la akcepto. Kioma horo nun estas?“

„Ĝuste la dekdua, sinjoro. Li devas jam baldaŭ veni, sinjoro.“[fn:B1891]
#+end_quote
Malpli nuancita, tiu maniero estas malpli esprimiva. Ekz‑e la [[Bazarov][supre
citita peco]] el «Patroj kaj filoj» jene aspektas en la misredaktitaj
eldonoj oftaj en la Reto[fn:Inko]:
#+begin_quote
“Vi estas tre modesta … Sed mi dezirus ekscii ion pri vi, pri via familio (…)”

Kial ŝi diras tion al mi? pensis Bazarov.

“Ĉio ĉi tute ne estas interesa”, diris li voĉe (…)”
#+end_quote
En ĉi tiaj okazoj la rekta parolo restas tute nemarkita, por ne miksiĝi
kun la voĉa dialogo – kvankam en la aliaj lokoj ĝin markas citiloj.

