doc/apostrofoj.md


<a id="orgacd9991"></a>

## Citaĵo en citaĵo

Plureco de la citilaj specoj utilas okaze de citaĵoj enmetitaj en
citaĵon. Estas kiel pri la krampoj en la matematikaj formuloj: la esprimo

    7 – {[(10 – 6) × 5] + 13}

legeblas pli facile ol

    7 – (((10 – 6) × 5) + 13)

Ho ve, allasinte plurajn citilajn formojn, Zamenhofo ne profitis la
eblojn kiujn tio donas. Ekz‑e en sia traduko de «La batalo de l' vivo»
(1891):

> „aldonu ankoraŭ la vortojn „kaj fingringo“, kaj mi volas la ambaŭ
> sentencojn pendigi en la loĝejo anstataŭ la portreto de mia mastrino.“

Ĉu Zamenhofo malvolis kompliki la lingvon?

Ĉiel ajn, en la reeldono de «La batalo», serioze reviziita de la
britaj editoroj, la citiloj estas diferencigitaj (kio estas bona), sed
por la internaj citiloj estas uzataj la anglaj kurbaj citiloj unuoblaj 6-9
(kio estas bedaŭrinda):

> “Dio nin gardu de tio ĉi! Ŝi vivu kaj … poste ŝi diru kun tiu franco:
> ‘La komedio estas finita, faligu la kurtenon.’”

Nuntempe kiam la komputiloj elskatole disponigas riĉegan sortimenton da
signoj, kaj inter ili ĉiujn citilojn Fundamentajn, estas neracie uzi
la konfuzajn apostrofajn citilojn. En la [moderna revizio](http://kovro.heliohost.org/books/la_batalo/batalof.html) de la
«Batalo» tiu ekzemplo havas do la formon:

> «Dio nin gardu de tio ĉi! Ŝi vivu kaj ridadu pri tio ĉi kiel longe ŝi
> povas ridi, kaj poste ŝi diru kun tiu franco: „La komedio estas
> finita, faligu la kurtenon.“»

Simila kungluiĝo povas okazi ankaŭ komence de la ekstera citaĵo, kaj
ankaŭ ĉi-okaze la sammaniera malambiguigo egale klaras:

> «„Faru ion al la homoj, por ke ili nenion al vi faru“, vi kredeble
> pensas?» diris sinjoro Snitchey.

(kp “‘Faru … al vi faru’ …”).

La Unikoda normo rekomendas unuoblajn angulajn citilojn por la
internaj citaĵoj<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>; tamen ene de la duoblaj angulaj citiloj tio
estas same konfuza, kiel la anglaj apostrofaj citiloj ene de la
duoblaj anglaj citiloj kurbaj. Por facila distingeblo la internaj
citiloj devas esti alispecaj ol la eksteraj.


<a id="orgbd95464"></a>

## Memreprezentaĵoj kaj sencodifinoj

Aparta uzo de la citiloj estas marki memreprezentaĵojn (aŭtonimojn), t.e.
tiajn uzojn de vortoj aŭ aliaj signoj, en kiuj ili reprezentas ne la
*signaton*, sed la *signanton*, t.e. sin mem. Tiaj uzoj oftas en
lingvoscienco, kaj plurajn ekzemplojn disponigas la *Fundamenta
Ekzercaro* (FE):

> &#x2026; tiel same ni ankaŭ diras: „la birdo flugis en la ĝardenon, sur la
> tablon“, kaj la vortoj „ĝardenon“, „tablon“ staras tie ĉi en akuzativo
> ne ĉar la prepozicioj „en“ kaj „sur“ tion ĉi postulas, sed nur ĉar
> ni volis esprimi direkton &#x2026; — FE §28

> La sufikso «um» ne havas difinitan signifon. &#x2013; FE §42.

Zamenhofo neniam apartigis ĉi tian uzon de la citiloj; sed en fakaj
tekstoj lingvosciencaj oni ofte uzas tiucele la anglajn citilojn
apostrofajn: ‘ĝardenon’, ‘tablon’, ‘sur’&#x2026;

Tio estas konfuza kaj maloportuna. Mi koncedas, ke la duoblaj
citiloj ĉirkaŭ mallonga vorto aŭ unuopa signo povas impresi kiel io
peza, iom grandioza; sed ĝenerale disponeblaj estas la unuoblaj angulaj
citiloj ‹x›, kiuj aspektas sufiĉe modeste kaj estas malambiguaj. Kp:

> Anstataŭ ‘la’ oni povas ankaŭ diri ‘lʼ’  
> Anstataŭ ‹la› oni povas ankaŭ diri ‹lʼ›.

> La tajpila-Askia apostrofo ‹'› povas reprezenti
> 
> -   la apostrofajn citilojn (la malferman ‹‘› aŭ la ferman ‹’›),
> -   proprasencan apostrofon ‹ʼ›,
> -   minutsignon ‹′›,
> -   dekstran kornon ‹′› &#x2026;

En la anglaj apostrofaj citiloj tia frazo estas malfacile legebla
(resp. ‘'’, ‘‘’, ‘ʼ’, ‘’’, ‘′’, ‘′’), kaj tute prave la franca
Vikipedio uzas la unuoblajn angulajn citilojn en la koncernaj partoj de
la artikolo «[Apostrophe (typographie)](https://fr.wikipedia.org/wiki/Apostrophe_(typographie)#Ambigu%C3%AFt%C3%A9s)». Kaj ankaŭ ĉe la malsupraj signoj la
apostrofaj citiloj aspektas aĉe: punkto ‘.’; zoeto ‘¸’ – pli klaras  ‹.›,  ‹¸›.

Tiusence anstataŭ la citilojn oni ankaŭ uzas kursivon.

Alia lingvista uzo de la apostrofaj citiloj estas apartigi
sencodifinojn. Jen ekzemplo kie memreprezentaĵo aperas kursive, kaj
sencodifinoj, en citiloj. Ankaŭ ĉi-okaze uzeblas unuoblaj angulaj citiloj<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>:

> *ruĝi* = ‘esti ruĝa, impresi ruĝe’, sed nepre ne ‘igi ruĝa’ nek ‘iĝi ruĝa’  
> *ruĝi* = ‹esti ruĝa, impresi ruĝe›, sed nepre ne ‹igi ruĝa› nek ‹iĝi ruĝa›

Probable tiuj estas la solaj iom internaciaj uzoj de la apostrofaj citiloj.


<a id="org8feba5c"></a>

## La rekta parolo

Unu el la ĉefaj funkcioj de la citiloj estas prezenti la rektan
parolon. Estas 2 specoj de rekta parolo: monologo kaj
dialogo. Monologon oni plejparte encitiligas; sed pri dialogoj la
naciaj (kaj sekve ankaŭ la Esperantaj) tradicioj varias.

En Esperanto kunekzistas du manieroj prezenti dialogojn: la ĝermana
kaj la franca-pola-rusa. Zamenhofo uzadis jen unu, jen la alian.


<a id="org8e3fa17"></a>

### La maniero franca-pola-rusa

En ĉi tiu maniero dialogo estas konceptata ne kiel pluro da monologoj,
sed kiel aparta speco de parol-agado. Ĉiu eldiro komencas novan
alineon kaj estas antaŭata de haltostreko:

> – Estimata sinjorino kredeble havas bezonon al la informa oficejo? –
> diris la mastrino de la loĝejo.
> 
> – Jes, sinjorino, – respondis la venintino. – Mi estas Marta Świcka.
> 
> – Volu sidiĝi kaj atendi momenton, ĝis mi finos la interparoladon kun
> tiuj sinjorinoj, kiuj venis antaŭe. &#x2013; («Marta»)

<a id="orgf64b402"></a>
Tiu aparta interpunkcio ebligas, interalie, klare diferencigi la
dialogon (la eldirojn eksterigatatajn) disde la paralela monologo interna
(rekta parolo enmensa), ekz‑e

> – Vi estas tre modesta … Sed mi dezirus ekscii ion pri vi, pri via
> familio, pri via patro, pro kiu vi forlasas nin.
> 
> «Kial ŝi diras tion al mi?» – pensis Bazarov.
> 
> – Ĉio ĉi tute ne estas interesa, – diris li voĉe, – precipe por vi, ni
> estas malaltaj homoj … («Patroj kaj filoj», ĉap. 17ª)<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>

Ankaŭ la eningita rekta parolo apektas pli bone:

> – Efektive, okulfrapis, kiam mi vidis lin post tiu travivaĵo, lia
> mirinda sereneco. Li diris: «Mia animo similas vastan trankvilan
> lagon». Ĉu vi iam aŭdis pri iu, kiu, en unu tago, transiris el
> plej profunda deprimiĝo en perfektan serenecon kun plena malapero
> de ĉiuj psikaj simptomoj?<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup> 

Similaj ekzemploj troveblas ekz‑e ankaŭ en la Zamenhofa traduko de «Marta».

**Noto.** En la cirilalfabeta tipografio oni markas la dialogojn per
haltostrekoj 0.8 em longaj – pli longaj, ol la angla N-streko
(*en-dash*, 0.5 em), sed ne tiom grandiozaj, kiel la angla *M-dash*
(1 em). Bedaŭrinde, Unikodo kaj plimulto da tiparoj disponigas nur la
anglajn haltostrekojn. En la ĉi-supraj ekzemploj mi uzis N-strekojn
(U+2013).


<a id="orge834881"></a>

### La maniero ĝermana (angla-germana)

En tiu maniero dialogo aperas kiel simpla sinsekvo da rektaj paroloj
monologaj, ĉiu el kiuj komencas apartan alineon:

> „Ĉu vi ion vidis, Britain? ion aŭdis?“
> 
> „Estas tro mallume, por povi malproksime vidi, kaj tro multe da bruo
> en la domo, por povi ion aŭdi“, respondis la servanto.
> 
> „Tio ĉi estas vera! Tiom pli gaja estos la akcepto. Kioma horo nun estas?“
> 
> „Ĝuste la dekdua, sinjoro. Li devas jam baldaŭ veni, sinjoro.“<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>

Malpli nuancita, tiu maniero estas malpli esprimiva. Ekz‑e la [supre
citita peco](#orgf64b402) el «Patroj kaj filoj» jene aspektas en la misredaktitaj
eldonoj oftaj en la Reto<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>:

> “Vi estas tre modesta … Sed mi dezirus ekscii ion pri vi, pri via familio (…)”
> 
> Kial ŝi diras tion al mi? pensis Bazarov.
> 
> “Ĉio ĉi tute ne estas interesa”, diris li voĉe (…)”

En ĉi tiaj okazoj la rekta parolo restas tute nemarkita, por ne miksiĝi
kun la voĉa dialogo – kvankam en la aliaj lokoj ĝin markas citiloj.
