doc/apostrofoj.org
*** Aliaj signoj similaj
Krom jam indikitaj uzoj por prezenti la gramatikan apostrofon kaj la
unuoblajn citilojn, la Askia apostrofo povas aperi anstataŭ minutsigno
(=3'10"=, t.e. «3 minutoj 10 sekundoj», tipografie «3′10″»; la angula
minuto, ekz‑e =42°25'=, tipografie «42°25′»). En la «Universala
vortaro» la minutsigno disigas morfemojn: «ge′patr′o′j»; iuj legantoj
povas konfuzi tion kun apostrofo, precipe en senserifa tiparo; la nunaj
vortaristoj (ekz‑e en PIV) uzas tiufunkcie la oblikvon (ge/patr/o/j),
signon iom tro grandan; nacilingve vortaristoj ofte uzas tiusence
la mezaltan punkton, kio aspektas pli elegante: «ge‧patr‧o‧j».

* Kodoj
** Tajpiloj kaj Askio
Askio (difinita en la jaro 1963ª) disponigas la tipan signaron de tajpilo Usona.

La apostrofo ‹'› (27_{16}) havas la simetrian formon de supra vertikala
streko, kaj krom la propran apostrofon prezentas ankaŭ la malferman
kaj la ferman unupecajn citilojn anglalingvajn.

Simile, la citilojn prezentas supra vertikala dustreko ‹"› (22_{16},
«lepororeloj»).

Tio aspektas akcepteble en egalpaŝa tajpaĵo (ĉar la du strekoj de
‹"› aperas sampaŝe, do pli dense ol la unustreka apostrofo):
#+begin_quote
=Anstataŭ "la" oni povas ankaŭ diri "l'".=
#+end_quote
sed tio aĉas en tipografia tiparo proporcia:
#+begin_quote
Anstataŭ "la" oni povas ankaŭ diri "l'".
#+end_quote
La estetika emo unuecigi la formojn (kiel en la angla tradicio pri la
apostrofo ‹’›, la citiloj unuoblaj ‘x’ kaj duoblaj “x”) kolizias kun
la legeblo, samkiel la konfuzo de I kaj l en la senserifaj tiparoj.

** La 8-bitaj kodoj
Serio da normoj ISO-8859 (1985–2001) diversmaniere kompletigas Askion per
diakritoj uzataj en diversaj lingvoj naciaj. ISO-8859‑3 (alinome
Latina‑3ª) disponigas ĉiujn literojn Esperantajn, sed koncerne la
citilojn kaj apostrofojn ĉio restas samkiel en Askio.

La normo ISO-8859‑1 (alinome Latina-1ª), destinita por la lingvoj
okcidentaj, ja disponigas la paron da duoblaj angulaj citiloj «x» –
kaj neniajn citilojn komoformajn; en tio mi vidas implican rekomendon
pri uzindo de ĝuste tiaj citiloj, kiajn mi mem ĉi-supre prezentis kiel
la plej konvenaj por Esperanto. Cetere, laŭ la mapoj de Edmundo
Grimley Evans la duoblaj angulaj citiloj «x» estas tre internaciaj[fn:EGE]

Ekzistas tajpiloj (ekz‑e la [[https://en.wikipedia.org/wiki/QWERTY#French_(Canada)][franckanada qwerty-tajpilo]]) kiuj elskatole
disponigas tiujn citilojn en sia klavaro.

Surbaze de la normoj ISO-8859, Majkrosofto kreis siajn «kodpaĝojn»
[[https://en.wikipedia.org/wiki/Windows-1252][CP-1252]], [[https://en.wikipedia.org/wiki/Windows-1250][CP-1250]] …, plenigante la kodpoziciojn 80_{16}…9F_{16} (kiujn
ISO-8859 rezervas por stirsignoj) je signoj videblaj, interalie la
paraj kurbaj citiloj (la anglaj “x” kaj ‘x’; la germanaj „x“ kaj ‚x‛),
la unuoblaj angulaj ‹x› (la duoblaj angulaj citiloj retenas sian lokon
laŭ la Latina-1ª). Estas malkohero en tio, ke dum ‹‚› (82_{16},
«malsupra unuobla 9‑citilo», grafike identa kun komo) ricevas apartan
signonumeron, la kurba apostrofo (grafike identa kun ‹’› = 92_{16}, la
«supra unuobla komo-citilo»), apartan signon ne ricevas.

Unu el la normaj 8-bitaj kodoj, [[https://en.wikipedia.org/wiki/ISO/IEC_8859‑7][ISO/IEC 8859‑7]] (Latina/Greka)
disponigas la kurban apostrofon ĉe la signonumero A2_{16} = 162_{10}
(la Latina‑3ª havas tie la bovlon ‹˘›); en la normo ĝi estas difinita
per la Unikoda signonumero U+02BC.

