doc/apostrofoj.org
** Unikodo
Nuntempe Unikodo estas la fakta normo por la tekstoj en Esperanto, kaj
ĝi disponigas pli ol sufiĉe da signoj por tio.

Interalie disponeblas ĉiuj supre menciitaj citiloj; disponeblas
speciala signo por la kurba apostrofo tipografia:
: ‹ʼ› U+02BC, modifier letter apostrophe
(Ĉu vi vidas apostrofon inter la angulaj citiloj? Pri ĝia disponeblo
en la tiparoj mi parolos [[W4][ĉi-sube]].)

Tamen ĝia prisktibo en la Unikoda Normo[fn:Uni06] impresas iom strange:
#+begin_quote
*Apostrofo litera.* U+02BC, «modifilo la apostrofo litera», estas
preferinda tie, kie la apostrofo prezentas modifantan literon (ekz‑e
por indiki glotan halton en transliteraĵoj). En tiu lasta okazo ĝi
ankaŭ estas nomata /apostrofo litera./ -- P. 275 (traduko mia)
#+end_quote
# *Letter Apostrophe.* U+02BC MODIFIER LETTER APOSTROPHE is preferred
# where the apostrophe is to represent a modifier letter (for example,
# in transliterations to indicate a glottal stop). In the latter case,
# it is also referred to as a /letter apostrophe./
# # Category: Letter, Modifier

Konforme al la nomo «apostrofo litera», tiu signo havas en la
Unikoda datumbazo[fn:UD] la sintaksan klason /litero/ (Category: Letter). 
Tiu klasifiko rolas en determino de vortaj limoj ĉe la
tekstotraktiloj; ekz‑e se vi faros duoblan alklakon sur la litero ‹a›
en vorto ‹katʼ› (aŭ respektive ‹kato›) en la ĉi-sekva linio:
#+begin_quote
katʼ estas kato (‹ʼ› = U+02BC)
#+end_quote
la komputilo apartigos ĉiujn 4 signojn de la vorto ‹katʼ› (samkiel
respektive ĉiujn 4 signojn de la vorto ‹kato›) – kaj tio estas lingve
ĝusta konduto.

Sed la Unikoda normo plu diras jene:
#+begin_quote
*Apostrofo interpunkcia.* U+2019, «la dekstra unuobla citilo», estas
preferinda tie, kie la apostrofo prezentas signon interpunkcian, kiel
ekz‑e en kuntiraĵoj: /We’ve been here before./ En tiu lasta okazo
U+2019 ankaŭ estas nomata /apostrofo interpunkcia./ -- P. 275 (traduko mia)
#+end_quote
# *Punctuation Apostrophe.* U+2019 RIGHT SINGLE QUOTATION MARK is
# preferred where the character is to represent a punctuation mark, as
# for contractions: /“We’ve been here before.”/ In this latter case,
# U+2019 is also referred to as a /punctuation apostrophe/
# # general-category: Pf (Punctuation, Final quote) 

Tio estas tre dubinda rekomendo. Ĝi evidente malkonvenas por
Esperanto, kie la apostrofo ĉiam estas parto de vorto, male ol kun la
apostrofo disiga:
#+begin_quote
kat’ estas kato (‹’› = U+2019)
#+end_quote
(la duobla alklako sur ‹kat’› apartigas nur la 3 literojn: ‹kat›).

Parte tiu rekomendo sencas [[fra][por la franca lingvo]]; sed ne tiom por la angla:
en /isn’t/ la apostrofo anstataŭas la mezan /o/ el /not;/ kaj al /we’ve/
triapersone ununombre respondas ne /he’ve/, sed /he’s/. Fakte tiu
rekomendo fontas ne el la lingva strukturo, sed el la neriparebla Vindoza
konfuzo kun la anglaj unuoblaj citiloj:
#+begin_quote
Praktiko (/an implementation/) ne povas kalkuli je tio, ke la teksto
de uzanto ĉiam konformas al la diferenco inter tiuj signoj. La teksto
povas veni el diversaj fontoj, inklude ĵetojn (/mappings/) el aliaj
signokodoj, kiuj ne distingas apostrofojn literajn disde la
interpunkciaj aŭ la fermaj citiloj unuoblaj. En tia okazo, ili /ĉiuj/
estu prezentataj per U+2019.
#+end_quote
# An implementation cannot assume that users’ text always adheres to the
# distinction between these characters. The text may come from different
# sources, including mapping from other character sets that do not make
# this distinction between the letter apostrophe and the punctuation
# apostrophe/right single quotation mark. In that case, /all/ of them will
# generally be represented by U+2019.
T.e. malgraŭ la aldono de la malambigua signo «apostrofo litera», oni
ĝin ignoru kaj plu konservu la konfuzon de la Vindoza CP-1252. Tiu
argumento malmulte sencas por la plimulto da lingvoj, kiuj ja
plejparte ne uzas la anglajn apostrofajn citilojn.
#+begin_quote
Do, la semantiko de U+2019 dependas je kunteksto. Ekz‑e interlitere aŭ
intercifere ĝi funkcias kiel enteksta signo interpunkcia kaj ne
disigas vortojn aŭ liniojn. (For example, if surrounded by letters or
digits on both sides, it behaves as an in-text punctuation character
and does not separate words or lines.) -- P. 276.
#+end_quote
# The semantics of U+2019 are therefore context dependent. For example,
# if surrounded by letters or digits on both sides, it behaves as an
# in-text punctuation character and does not separate words or lines.
Ĉi tiu konfuze vortumita alineo sugestas, kiel oni detektu la literan
signifon de la citilo: per la pozicio inter literoj. Iel-tiel tio
funkcias por la angla; sed ĝi plene fiaskas por Esperanto, kaj por
diversaj aliaj lingvoj, ekde la greka (kie unue aperis la signo kaj la
vorto ἀπόστροφος):
#+begin_verse
τα αδέλφια → τʼ αδέλφια
που είσαι → που ʼσαι
και εγώ → κιʼ εγώ
#+end_verse
ĝis la itala:
#+begin_verse
La donna è mobilʼ …
… e di pensierʼ!
#+end_verse
aŭ la suoma:
#+begin_verse
Se aikʼ olʼ ajoistʼ ankarin -- (Kaarlo Kramsu: „Ilkka“).
(= «Tio estis la plej malfacila tempo el ĉiuj»)
#+end_verse
# Это было самое тяжелое время (Каарло Крамсу: «Илкка»).
# It was the toughest time ever (Kaarlo Kramsu: "Ilkka").
# https://fi.wikipedia.org/wiki/Heittomerkki
# Punctuation marks generally break words; modifier letters generally
# are considered part of a word. -- P. 275

Tipografie en multaj tiparoj tiuj du apostrofoj aspektas egale (havas
unu saman signobildon); tiel estas ekz‑e en /Times New Roman,
FreeSerif, DejaVu, Noto/. En aliaj tiparoj la litera apostrofo estas
iomete malsama (ekz‑e malpli alta kaj malpli granda); tiel estas en
/Liberation, Gentium, Ubuntu/). Jen komparu ilin en via tiparo (kiaj
ilin prezentas via legilo): ’ ʼ. Mi ne scias, ĉu ekzistas iuj
tradiciaj trajtoj por diferencigi tiujn du signojn, kaj mi dubas, ĉu
utilas kontrastigi ilin en tipografio (tiom malpli, ke en Esperanto mi
opinias la apostrofajn citilojn neuzindaj); sed mi certas pri la
dezirindo vidigi la diferencon en «programista» tiparo (kaj mi vidigis
ĝin en mia [[https://github.com/pok49/fixed-9x18][malambiguiga tiparo]] egalpaŝa, kiun mi kutime uzas en mia
laboro).

<<W4>>
