doc/apostrofoj.md


<a id="orge60b253"></a>

## Unikodo

Nuntempe Unikodo estas la fakta normo por la tekstoj en Esperanto, kaj
ĝi disponigas pli ol sufiĉe da signoj por tio.

Interalie disponeblas ĉiuj supre menciitaj citiloj; disponeblas
speciala signo por la kurba apostrofo tipografia:

    ‹ʼ› U+02BC, modifier letter apostrophe

(Ĉu vi vidas apostrofon inter la angulaj citiloj? Pri ĝia disponeblo
en la tiparoj mi parolos [ĉi-sube](#org468d74e).)

Tamen ĝia prisktibo en la Unikoda Normo<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup> impresas iom strange:

> **Apostrofo litera.** U+02BC, «modifilo la apostrofo litera», estas
> preferinda tie, kie la apostrofo prezentas modifantan literon (ekz‑e
> por indiki glotan halton en transliteraĵoj). En tiu lasta okazo ĝi
> ankaŭ estas nomata *apostrofo litera.* &#x2013; P. 275 (traduko mia)

Konforme al la nomo «apostrofo litera», tiu signo havas en la
Unikoda datumbazo<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup> la sintaksan klason *litero* (Category: Letter). 
Tiu klasifiko rolas en determino de vortaj limoj ĉe la
tekstotraktiloj; ekz‑e se vi faros duoblan alklakon sur la litero ‹a›
en vorto ‹katʼ› (aŭ respektive ‹kato›) en la ĉi-sekva linio:

> katʼ estas kato (‹ʼ› = U+02BC)

la komputilo apartigos ĉiujn 4 signojn de la vorto ‹katʼ› (samkiel
respektive ĉiujn 4 signojn de la vorto ‹kato›) – kaj tio estas lingve
ĝusta konduto.

Sed la Unikoda normo plu diras jene:

> **Apostrofo interpunkcia.** U+2019, «la dekstra unuobla citilo», estas
> preferinda tie, kie la apostrofo prezentas signon interpunkcian, kiel
> ekz‑e en kuntiraĵoj: *We’ve been here before.* En tiu lasta okazo
> U+2019 ankaŭ estas nomata *apostrofo interpunkcia.* &#x2013; P. 275 (traduko mia)

Tio estas tre dubinda rekomendo. Ĝi evidente malkonvenas por
Esperanto, kie la apostrofo ĉiam estas parto de vorto, male ol kun la
apostrofo disiga:

> kat’ estas kato (‹’› = U+2019)

(la duobla alklako sur ‹kat’› apartigas nur la 3 literojn: ‹kat›).

Parte tiu rekomendo sencas [por la franca lingvo](#org8a54e4f); sed ne tiom por la angla:
en *isn’t* la apostrofo anstataŭas la mezan *o* el *not;* kaj al *we’ve*
triapersone ununombre respondas ne *he’ve*, sed *he’s*. Fakte tiu
rekomendo fontas ne el la lingva strukturo, sed el la neriparebla Vindoza
konfuzo kun la anglaj unuoblaj citiloj:

> Praktiko (*an implementation*) ne povas kalkuli je tio, ke la teksto
> de uzanto ĉiam konformas al la diferenco inter tiuj signoj. La teksto
> povas veni el diversaj fontoj, inklude ĵetojn (*mappings*) el aliaj
> signokodoj, kiuj ne distingas apostrofojn literajn disde la
> interpunkciaj aŭ la fermaj citiloj unuoblaj. En tia okazo, ili *ĉiuj*
> estu prezentataj per U+2019.

T.e. malgraŭ la aldono de la malambigua signo «apostrofo litera», oni
ĝin ignoru kaj plu konservu la konfuzon de la Vindoza CP-1252. Tiu
argumento malmulte sencas por la plimulto da lingvoj, kiuj ja
plejparte ne uzas la anglajn apostrofajn citilojn.

> Do, la semantiko de U+2019 dependas je kunteksto. Ekz‑e interlitere aŭ
> intercifere ĝi funkcias kiel enteksta signo interpunkcia kaj ne
> disigas vortojn aŭ liniojn. (For example, if surrounded by letters or
> digits on both sides, it behaves as an in-text punctuation character
> and does not separate words or lines.) &#x2013; P. 276.

Ĉi tiu konfuze vortumita alineo sugestas, kiel oni detektu la literan
signifon de la citilo: per la pozicio inter literoj. Iel-tiel tio
funkcias por la angla; sed ĝi plene fiaskas por Esperanto, kaj por
diversaj aliaj lingvoj, ekde la greka (kie unue aperis la signo kaj la
vorto ἀπόστροφος):

τα αδέλφια → τʼ αδέλφια  
που είσαι → που ʼσαι  
και εγώ → κιʼ εγώ

ĝis la itala:

> La donna è mobilʼ …  
> … e di pensierʼ!  

aŭ la suoma:
> Se aikʼ olʼ ajoistʼ ankarin &#x2013; (Kaarlo Kramsu: „Ilkka“).  
> (= «Tio estis la plej malfacila tempo el ĉiuj»)

Tipografie en multaj tiparoj tiuj du apostrofoj aspektas egale (havas
unu saman signobildon); tiel estas ekz‑e en *Times New Roman,
FreeSerif, DejaVu, Noto*. En aliaj tiparoj la litera apostrofo estas
iomete malsama (ekz‑e malpli alta kaj malpli granda); tiel estas en
*Liberation, Gentium, Ubuntu*). Jen komparu ilin en via tiparo (kiaj
ilin prezentas via legilo): ’ ʼ. Mi ne scias, ĉu ekzistas iuj
tradiciaj trajtoj por diferencigi tiujn du signojn, kaj mi dubas, ĉu
utilas kontrastigi ilin en tipografio (tiom malpli, ke en Esperanto mi
opinias la apostrofajn citilojn neuzindaj); sed mi certas pri la
dezirindo vidigi la diferencon en «programista» tiparo (kaj mi vidigis
ĝin en mia [malambiguiga tiparo](https://github.com/pok49/fixed-9x18) egalpaŝa, kiun mi kutime uzas en mia
laboro).
