doc/apostrofoj.org
** WGL4
Krom la dubindaj (kaj por Esperanto nevalidaj) argumentoj, prezentitaj
en la ĵus citita misrekomendo[fn:mis], ekzistas ankoraŭ unu konsidero,
praktike pli grava, kiun tamen la Unikoda dokumento ne citas (probable
ĉar la argumento estas iom hontinda por la grava instanco): la
Majkrosofta normo [[https://eo.wikipedia.org/wiki/WGL4][WGL4]] (vu-go-lo kvar), kiu pretendis (ĉu plu
pretendas?) esti «la Askio de la 21ª jarcento»[fn:MES]. Multaj tiparoj
Majkrosoftaj disponigas la tutan, sed ankaŭ /ne pli ol la tutan/
signaron de WGL4. Nu, samkiel la Majkrosofta CP-1252, WGL4 disponigas
la citilon U+2019, sed ne la apostrofon U+02BC. Tial, se oni volas
disponigi oniajn tekstojn por kiel eble plej vasta publiko, oni oferu
la logikon al la monopolo.

Tamen tiu argumento ne estas tiom forta, kiel ĝi ŝajnas:

Unue, la tiparoj iĝas ĉiam pli riĉaj, kaj kun la paso de tempo tiu
argumento ĉiam malpli aktualas. Averaĝe miaj tiparoj Linuksaj (mi ja
uzas Linukson) estas pli riĉaj ol WGL4, kaj ili disponigas la
apostrofon literan. Ekz‑e la [[https://en.wikipedia.org/wiki/Liberation_fonts][Liberation]]-familio (defaŭlta en
[[https://eo.wikipedia.org/wiki/LibreOffice][LibreOffice]]), [[https://en.wikipedia.org/wiki/DejaVu_fonts][DejaVu]] k.m.a.[fn:ehxo]

Due, ĉe vidigo de teksto per tiparo manka je tia apostrofo, deca
aplikaĵo ŝtopas la truon per signo el konvena [[https://www.reta-vortaro.de/revo/art/tip.html#tip.vic0aro][victiparo]]. Supozeble la
leganto mem povas sperti tion per sia foliumilo, kiu espereble iel
surekranigas la literan apostrofon ‹ʼ›. Mi tamen koncedas, ke la
victipara apostrofo iam ne tute harmonie akordas kun la elektita
ĉeftiparo ☹

Mi kontrolis disponeblon de la litera apostrofo U+02BC en la plej
gravaj tiparoj de /Windows7/ kaj /Linux Mint/ :

- *La literan apostrofon havas:*
  + Vindoze:
    - Times New Roman, Arial, Courier New;
    - Cambria, Calibri, Lucida Sans Unicode, Microsoft Sans Serif...
    - Consolas...
  + Linukse (tutaj tiparaj familioj):
    - Liberation, DejaVu, Ubuntu, Noto, Free, Roboto Slab...
- *La literan apostrofon malhavas:*
  + Vindoze:
    - Georgia, Verdana, Gabriola, Constantia, Trebuchet MS, Comic Sans MS;
    - Lucida Sans Console ... 
  + Linukse:
    - Nimbus, C059 (≈ New Century Schoolbook), URW Bookman, Z003
      (≈ Zapf Chancery), P052 (≈ Palatino)...

Resume, mi ankoraŭ hezitas. Tial mi ebligis al la uzuloj laŭplaĉe
elekti la signon en la [[EI][Emaksa interfaco]].

<<wiki>>
** Vikipedio 
Mallogite de la Unikoda konfuzo oni eble pripensos revenon al la
senartifika Askia apostrofo. Ĝi certe estas vaste uzata (kaj eĉ
preferata) en neformala komunikado (ekz‑e en retpoŝto); kaj ĝia
simetria rekta formo eĉ estas pli logika por tia nepara signo,
kontraste al la paraj citiloj kurbaj: ‘x’. Kaj ĝi estas tre oportune
klavebla.

Tiu oportuno, kaj la havaja etimo de la komenca parto de la vorto
/Vikipedio/, povas pensigi, ke la rekta apostrofo estas la konvena
apostrofo por Vikipedio. Sed ne estas tiom simple.

Ĝuste pro la facileco enigi la askian apostrofon, en Vikipedio opoj da
apostrofoj estas uzataj por indiki tiparajn fasonojn:
''/kursivo/'', '''*graseto*''', ''''*/graseta kursivo/*''''.
En Esperanto tia konvencio kolizias kun la litera funkcio de
apostrofo, kiam oni redaktas Vikipedian artikolon helpate de
literumilo – ekz‑e la artikolon «[[https://eo.wikipedia.org/wiki/Majusklo][Majusklo]]», kies fontteksto komenciĝas
jene:
: '''Majusklo''' (aŭ '''grandlitero''' aŭ
: '''ĉeflitero''') estas unu el du formoj,
: kiujn povas havi ĉiu litero ...
kaj tio kaŭzas ĝenajn misavertojn pri la neekzistantaj vortoj
@@html:<code>'''Majusklo'''</code>, <code>'''grandlitero'''</code>,
<code>'''ĉeflitero'''</code>@@
(la literumilaj vortaroj angla kaj franca agnoskas vortajn apostrofojn
nur interlitere, tial – malsame ol por Esperanto – la ĉirkaŭa markado
per apostrofoj ne kaŭzas problemojn por tiuj lingvoj).

La solvo por Esperanto estas prezenti la vortan apostrofon per alia
signo ol la Askia apostrofo; ankaŭ la fajna tipografio postulas ke la
vortaj apostrofoj estu kurbaj.

* Komparo de literumiloj
** Ispell
Ĉi tiu studaĵo fontas el mia laboro pri vortaro por Ispelo, t.e. por
la literumilo /Ispell/, la plej malnova (unue aperinta en la jaro
1971ª) el la ankoraŭ uzataj. Samkiel la aliaj literumiloj, Ispelo
ebligas atribui al signoj interliteraj (kiaj la streketo ‘-’ kaj la
Askia apostrofo) la statuson vorteran; tio konvenas por la streketo,
sed maltaŭgas por la apostrofo Esperanta. Nu, malsimile ol multaj
aliaj literumiloj, Ispelo permesas klasi la apostrofon kun la literoj,
kio ebligas uzi ĝin ajnloke en vorto, do ankaŭ vortofine. Ĵus ni
vidis, ke tio tamen ĝenas en la laboroj Vikipediaj.

Ispelo ebligas difini plurajn tekstoprezentojn uzeblajn kun unu sama
vortaro kaj facile komuteblajn – kiaj ekz‑e la Teĥa ~^cirka^u~-skribo,
la iksisma ~cxirkaux~-surogato, la prezento per la Latina‑3ª… En tiuj
prezentoj la apostrofo aperas Askie, do konfuze. Tial mi aldonis
kroman prezenton =epo= (la norma 3-litera siglo por /Esperanto/ en
ISO 639). Por Ispelo ĝi indikas la tekstoprezenton en kiu la rolon de
apostrofo ludas la paŝiga dekstra korno ‹´› (B4_{16}, /spacing acute/),
signo en la uzulaj tekstoj senutila, kiu tamen liberigas la Askian
apostrofon el la rolo de vortero (tio utilas por la [[wiki][laboroj Vikipediaj]]);
kaj al [[EI][la Emaksa interfaco]] ĝi ebligas trakti la kurbajn
apostrofojn, kiel priskribite en la tujsekva subsekcio.

<<EI>>
*** La Emaksa interfaco
Praktike mi uzas Ispelon tra [[https://eo.wikipedia.org/wiki/Emacs][Emakso]], redaktante tekstojn Unikodajn. La
Emaksa interfaco =ispell.el= travideble transkodas inter la Unikoda
prezento de la redaktata teksto kaj la Ispela (aŭ Aspela, aŭ Hunspela)
fasado en la Latina‑3ª. La sola problemo estas pri kurba apostrofo,
kiun la Latina‑3ª malhavas; por solvi tion mi verkis kromaĵon
=ispell-ini.el= por la Emaksa interfaco, kiu kromaĵo apartigas la
vortojn kun kurba apostrofo, transkodas ilin en la prezenton laŭ la
Latina‑3ª, kaj poste rekodas la unubajtajn apostrofojn de la Ispela
respondo en la formon Unikodan. Tion egale bone eblas programi por
ajna apostrofo Unikoda, ĉu U+02BC, ĉu U+2019; la varianton regas la
variablo =ispell-apostrophe= en =ispell-ini.el=. Defaŭlte ĝi ricevas
la valoron citilan (U+2019), sed la funkcio =ispell-set-apostrophe=
ebligas baskule ĝin ŝanĝi al la apostrofo litera (U+02BC) aŭ reen. La
funkcion eblas voki dialoge:
: M-x ispell-set-apostrophe
aŭ el programo:
: (ispell-set-apostrophe)
La kurantan valoron de la variablo eblas ekzameni per
: C-h v RET ispell-apostrophe
Tiu variablo kaj ĝia valoro influas nur la reĝimon (la «vortaron»,
fakte la interfacon) =epo=; en la aliaj reĝimoj (ekz‑e =eo=) ili
neniel efikas, kaj la apostrofoj restas Askiaj.

