doc/apostrofoj.md

<a id="org468d74e"></a>
<a id="orgd4a624e"></a>

## WGL4

Krom la dubindaj (kaj por Esperanto nevalidaj) argumentoj, prezentitaj
en la ĵus citita misrekomendo<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>, ekzistas ankoraŭ unu konsidero,
praktike pli grava, kiun tamen la Unikoda dokumento ne citas (probable
ĉar la argumento estas iom hontinda por la grava instanco): la
Majkrosofta normo [WGL4](https://eo.wikipedia.org/wiki/WGL4) (vu-go-lo kvar), kiu pretendis (ĉu plu
pretendas?) esti «la Askio de la 21ª jarcento»<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>. Multaj tiparoj
Majkrosoftaj disponigas la tutan, sed ankaŭ *ne pli ol la tutan*
signaron de WGL4. Nu, samkiel la Majkrosofta CP-1252, WGL4 disponigas
la citilon U+2019, sed ne la apostrofon U+02BC. Tial, se oni volas
disponigi oniajn tekstojn por kiel eble plej vasta publiko, oni oferu
la logikon al la monopolo.

Tamen tiu argumento ne estas tiom forta, kiel ĝi ŝajnas:

Unue, la tiparoj iĝas ĉiam pli riĉaj, kaj kun la paso de tempo tiu
argumento ĉiam malpli aktualas. Averaĝe miaj tiparoj Linuksaj (mi ja
uzas Linukson) estas pli riĉaj ol WGL4, kaj ili disponigas la
apostrofon literan. Ekz‑e la [Liberation](https://en.wikipedia.org/wiki/Liberation_fonts)-familio (defaŭlta en
[LibreOffice](https://eo.wikipedia.org/wiki/LibreOffice)), [DejaVu](https://en.wikipedia.org/wiki/DejaVu_fonts) k.m.a.<sup><a id="fnr.13" class="footref" href="#fn.13" role="doc-backlink">13</a></sup>

Due, ĉe vidigo de teksto per tiparo manka je tia apostrofo, deca
aplikaĵo ŝtopas la truon per signo el konvena [victiparo](https://www.reta-vortaro.de/revo/art/tip.html#tip.vic0aro). Supozeble la
leganto mem povas sperti tion per sia foliumilo, kiu espereble iel
surekranigas la literan apostrofon ‹ʼ›. Mi tamen koncedas, ke la
victipara apostrofo iam ne tute harmonie akordas kun la elektita
ĉeftiparo ☹

Mi kontrolis disponeblon de la litera apostrofo U+02BC en la plej
gravaj tiparoj de *Windows7* kaj *Linux Mint* :

-   **La literan apostrofon havas:**
    -   Vindoze:
        -   Times New Roman, Arial, Courier New;
        -   Cambria, Calibri, Lucida Sans Unicode, Microsoft Sans Serif&#x2026;
        -   Consolas&#x2026;
    -   Linukse (tutaj tiparaj familioj):
        -   Liberation, DejaVu, Ubuntu, Noto, Free, Roboto Slab&#x2026;
-   **La literan apostrofon malhavas:**
    -   Vindoze:
        -   Georgia, Verdana, Gabriola, Constantia, Trebuchet MS, Comic Sans MS;
        -   Lucida Sans Console &#x2026;
    -   Linukse:
        -   Nimbus, C059 (≈ New Century Schoolbook), URW Bookman, Z003
            (≈ Zapf Chancery), P052 (≈ Palatino)&#x2026;

Resume, mi ankoraŭ hezitas. Tial mi ebligis al la uzuloj laŭplaĉe
elekti la signon en la [Emaksa interfaco](#org2451701).

<a id="org23ad7e9"></a>


<a id="org65e69d9"></a>

## Vikipedio

Mallogite de la Unikoda konfuzo oni eble pripensos revenon al la
senartifika Askia apostrofo. Ĝi certe estas vaste uzata (kaj eĉ
preferata) en neformala komunikado (ekz‑e en retpoŝto); kaj ĝia
simetria rekta formo eĉ estas pli logika por tia nepara signo,
kontraste al la paraj citiloj kurbaj: ‘x’. Kaj ĝi estas tre oportune
klavebla.

Tiu oportuno, kaj la havaja etimo de la komenca parto de la vorto
*Vikipedio*, povas pensigi, ke la rekta apostrofo estas la konvena
apostrofo por Vikipedio. Sed ne estas tiom simple.

Ĝuste pro la facileco enigi la askian apostrofon, en Vikipedio opoj da
apostrofoj estas uzataj por indiki tiparajn fasonojn:
''*kursivo*'', '''**graseto**''', ''''***graseta kursivo***''''.
En Esperanto tia konvencio kolizias kun la litera funkcio de
apostrofo, kiam oni redaktas Vikipedian artikolon helpate de
literumilo – ekz‑e la artikolon «[Majusklo](https://eo.wikipedia.org/wiki/Majusklo)», kies fontteksto komenciĝas
jene:

    '''Majusklo''' (aŭ '''grandlitero''' aŭ
    '''ĉeflitero''') estas unu el du formoj,
    kiujn povas havi ĉiu litero ...

kaj tio kaŭzas ĝenajn plendojn pri la neekzistantaj vortoj
<code>'''Majusklo'''</code>, <code>'''grandlitero'''</code>,
<code>'''ĉeflitero'''</code>
(la literumilaj vortaroj angla kaj franca agnoskas vortajn apostrofojn
nur interlitere, tial – malsame ol por Esperanto – la ĉirkaŭa markado
per apostrofoj ne kaŭzas problemojn por tiuj lingvoj).

La solvo por Esperanto estas prezenti la vortan apostrofon per alia
signo ol la Askia apostrofo; ankaŭ la fajna tipografio postulas ke la
vortaj apostrofoj estu kurbaj.


<a id="orgbf777cd"></a>

# Komparo de literumiloj


<a id="org0b15f28"></a>

## Ispell

Ĉi tiu studaĵo fontas el mia laboro pri vortaro por Ispelo, t.e. por
la literumilo *Ispell*, la plej malnova (unue aperinta en la jaro
1971ª) el la ankoraŭ uzataj. Samkiel la aliaj literumiloj, Ispelo
ebligas atribui al signoj interliteraj (kiaj la streketo ‘-’ kaj la
Askia apostrofo) la statuson vorteran; tio konvenas por la streketo,
sed maltaŭgas por la apostrofo Esperanta. Nu, malsimile ol multaj
aliaj literumiloj, Ispelo permesas klasi la apostrofon kun la literoj,
kio ebligas uzi ĝin ajnloke en vorto, do ankaŭ vortofine. Ĵus ni
vidis, ke tio tamen ĝenas en la laboroj Vikipediaj.

Ispelo ebligas difini plurajn tekstoprezentojn uzeblajn kun unu sama
vortaro kaj facile komuteblajn – kiaj ekz‑e la Teĥa `^cirka^u`-skribo,
la iksisma `cxirkaux`-surogato, la prezento per la Latina‑3ª… En tiuj
prezentoj la apostrofo aperas Askie, do konfuze. Tial mi aldonis
kroman prezenton `epo` (la norma 3-litera siglo por *Esperanto* en
ISO 639). Por Ispelo ĝi indikas la tekstoprezenton en kiu la rolon de
apostrofo ludas la paŝiga dekstra korno ‹´› (B4<sub>16</sub>, *spacing acute*),
signo en la uzulaj tekstoj senutila, kiu tamen liberigas la Askian
apostrofon el la rolo de vortero (tio utilas por la [laboroj Vikipediaj](#org23ad7e9));
kaj al [la Emaksa interfaco](#org2451701) ĝi ebligas trakti la kurbajn
apostrofojn, kiel priskribite en la tujsekva subsekcio.

<a id="org2451701"></a>


<a id="orgb5ab6c6"></a>

### La Emaksa interfaco

Praktike mi uzas Ispelon tra [Emakso](https://eo.wikipedia.org/wiki/Emacs), redaktante tekstojn Unikodajn. La
Emaksa interfaco `ispell.el` travideble transkodas inter la Unikoda
prezento de la redaktata teksto kaj la Ispela (aŭ Aspela, aŭ Hunspela)
fasado en la Latina‑3ª. La sola problemo estas pri kurba apostrofo,
kiun la Latina‑3ª malhavas; por solvi tion mi verkis kromaĵon
`ispell-ini.el` por la Emaksa interfaco, kiu kromaĵo apartigas la
vortojn kun kurba apostrofo, transkodas ilin en la prezenton laŭ la
Latina‑3ª, kaj poste rekodas la unubajtajn apostrofojn de la Ispela
respondo en la formon Unikodan. Tion egale bone eblas programi por
ajna apostrofo Unikoda, ĉu U+02BC, ĉu U+2019; la varianton regas la
variablo `ispell-apostrophe` en `ispell-ini.el`. Defaŭlte ĝi ricevas
la valoron citilan (U+2019), sed la funkcio `ispell-set-apostrophe`
ebligas baskule ĝin ŝanĝi al la apostrofo litera (U+02BC) aŭ reen. La
funkcion eblas voki dialoge:

    M-x ispell-set-apostrophe

aŭ el programo:

    (ispell-set-apostrophe)

La kurantan valoron de la variablo eblas ekzameni per

    C-h v RET ispell-apostrophe

Tiu variablo kaj ĝia valoro influas nur la reĝimon (la «vortaron»,
fakte la interfacon) `epo`; en la aliaj reĝimoj (ekz‑e `eo`) ili
neniel efikas, kaj la apostrofoj restas Askiaj.
