doc/apostrofoj.org
* Konkludo
Sen trudi miajn preferojn al iu ajn, mi jene konkludas pri la racia
prezento de tekstoj Esperantaj:

- Manskribe mi uzas la germanajn citilojn 99–66 kaj la kurban apostrofon
  komoforman: /„manskribʼ“/.
- Tajpile mi uzas la rektajn citilojn kaj la rektan apostrofon:@@html:<code> "tajpaĵ'"</code>@@.
- Retpoŝte mi uzas la angulajn citilojn (la plej klarajn) kaj la rektan
  apostrofon (komprenatan de la literumilo): «retpoŝt'».
- Tipografie mi uzas la angulajn citilojn kaj la kurban apostrofon
  literan (U+02BC): «tipografiʼ», se mi certas ke ĝi disponeblas en la
  uzota tiparo.
- Okaze de ingitaj citaĵoj mi uzas la angulajn citilojn ekstere kaj la
  kurbajn interne: «Li diris: „Mi venos!“».
- Estkiel «malpezajn» citilojn mi uzas la unuoblajn citilojn angulajn
  (la apostrofo rekta ‹'›, la artikolo ‹lʼ›, la subsigno ‹¸›).

Koncerne la literumilojn, la kombino Ispelo + Emakso estas por mi la
plej oportuna. Ĝi estas la plej diversflanka kaj ebligas egale facile
redakti kaj tekstojn tajpecajn (ekz‑e retpoŝtajn), kaj la
tipografiajn.

# «La Dua Libro», «La Ombro»:
# «Ĝi estas tiel, kiel se unu ripetas pecon, kiu estas por li tro
# malfacila, kaj kiun li ne povas ellerni, ĉian tiu sama peco. `Mi
# malgraŭ ĉio ĝin venkos’ li diras, sed li tamen ĝin ne venkas, kiel ajn
# longe li ludas».
# 
# „Mi vidis ĉion, kaj mi ĝin rakontos al vi; sed … ĝi ne estas fiereco
# de mia flanko, tamen … kiel homo libera, kaj ĉe mia instruiteco, ne
# parolante jam pri mia bona situacio kaj riĉeco … mi kore dezirus, ke
# vi parolu al mi ne „mia kara“, sed „sinj
# 
# Ĉarmaĵʼ misavertojn kvarilo


[fn:ifr]@@html:<span lang="fr">@@Pythoud, Christophe. Français-GUTenberg : un nouveau dictionnaire français pour ISPELL.
   Problèmes résolus et intégration de contributions extérieures.
   [[http://www.numdam.org/item/CG_1998___28-29_252_0.pdf][Cahiers GUTenberg, № 28-29 (1998), pp. 252–275]].@@html:</span>@@

[fn:PP] Peeraerts, Paul. [[http://www.ipernity.com/blog/paul_peeraerts/4617856][Pri „esperantlingvaj” kaj aliaj citiloj]]. Ipernity, 2016-06-05.

[fn:g1] “Single guillemets may be used for quotes inside quotes.” 
Unicode® Standard 15.1.0 (2023 Sept. 12). [[https://www.unicode.org/versions/Unicode15.0.0/ch06.pdf][Chapter 6]], p. 272.

[fn:BW] Wennergren, Bertilo. [[http://interlingvistiko.net/wp-content/uploads/2021/05/2-Wennergren.-Bazformoj-de-radikoj-en-vortaroj.pdf][Bazformoj de radikoj en vortaroj]].
   Esperantologio / Esperanto Studies, *4* (2009), p. 17.

[fn:PkF] Turgenev I.S., tradukis Kabe. [[https://books.google.ru/books?id=sJstAQAAMAAJ][Patroj kaj filoj]]. Librejo
«Esperanto», Moskvo, 1909. Ĉap. 17ª, p. 77.

[fn:Tien]  Johán Valano: [[https://legacy.esperanto.org.uk/eldonoj/piron/tekstoj/Tien.html][Tien]]. Vieno: IEM, 1997.

[fn:B1891] Dickens, Charles trad. Zamenhof, L. La batalo de lʼ vivo.
«La Esperantisto», vol. 2 (1891, feb.–jul. kaj sep.–nov.).

[fn:Inko] I. Turgenjev, tradukis Kabe. Patroj kaj filoj. Inko Tyresö, 2001.

[fn:EGE] Edmund Grimley Evans. Niaj citiloj. /La Brita Esperantisto,/
№ 990, Printempo 2021.

[fn:Uni06] Unicode® Standard 15.1.0 (2023 Sept. 12). [[https://www.unicode.org/versions/Unicode15.0.0/ch06.pdf][Chapter 6]].

[fn:UD] Unicode Data [[https://www.unicode.org/Public/UCD/latest/ucd/UnicodeData.txt][UDC.txt]].

[fn:advice] Malabarba, Artur. [[http://endlessparentheses.com/ispell-and-apostrophes.html][Ispell and Apostrophes]]. 11 May 2015.

[fn:mis] Pri ĝia nevalido eĉ por la angla lingvo vidu la blogaĵon
“[[https://tedclancy.wordpress.com/2015/06/03/which-unicode-character-should-represent-the-english-apostrophe-and-why-the-unicode-committee-is-very-wrong][Which Unicode character should represent the English apostrophe? (And why the Unicode committee is very wrong)]]” kaj la postan diskuton tie.

[fn:MES] Similcele ISO rekomendas 2 [[https://en.wikipedia.org/wiki/Unicode#Standardized_subsets][Multlingvajn Eŭropajn Subarojn]]
(MES) de Unikodo: [[https://www.cl.cam.ac.uk/~mgk25/ucs/mes-1-rationale.html][MES-1]] (por la latinaflabetaj skribsistemoj, 335
signoj) kaj MES-2 (por la alfabetoj latinaj, greka, cirilaj, 1062
signoj). Ambaŭ entenas kaj la literan apostrofon U+02BC, kaj la
citilon U+2019. (WGL4 situas meze: 657 signoj, kvankam ne ĉiujn
signifojn de MES-1 ĝi disponigas.)

[fn:ehxo] Ekzamenante la tiparojn mi rimarkis, ke la kutima testfrazo
pri la signoj speciale Esperantaj estas nekompleta, kaj mi jene ĝin
ŝanĝis: =Eĥoŝanĝʼ ĉiuĵaŭde= (por testi ankaŭ la literan apostrofon).

[fn:Exc] La ekzemplo estas reala preseraro el «[[https://eo.wikisource.org/wiki/El_Parnaso_de_Popoloj/Excelsior][Excelsior]]» de
Longfellow/Grabowski.

#  LocalWords:  tajpila-Askia BC CP Bazarov memreprezentaĵo MES Vimo
#  LocalWords:  antaŭapostrofa

* Footnotes

