doc/apostrofoj.md


<a id="orgee45095"></a>

# Konkludo

Sen trudi miajn preferojn al iu ajn, mi jene konkludas pri la racia
prezento de tekstoj Esperantaj:

-   Manskribe mi uzas la germanajn citilojn 99–66 kaj la kurban apostrofon
    komoforman: *„manskribʼ“*.
-   Tajpile mi uzas la rektajn citilojn kaj la rektan apostrofon:<code> "tajpaĵ'"</code>.
-   Retpoŝte mi uzas la angulajn citilojn (la plej klarajn) kaj la rektan
    apostrofon (komprenatan de la literumilo): «retpoŝt'».
-   Tipografie mi uzas la angulajn citilojn kaj la kurban apostrofon
    literan (U+02BC): «tipografiʼ», se mi certas ke ĝi disponeblas en la
    uzota tiparo.
-   Okaze de ingitaj citaĵoj mi uzas la angulajn citilojn ekstere kaj la
    kurbajn interne: «Li diris: „Mi venos!“».
-   Estkiel «malpezajn» citilojn mi uzas la unuoblajn citilojn angulajn
    (la apostrofo rekta ‹'›, la artikolo ‹lʼ›, la subsigno ‹¸›).

Koncerne la literumilojn, la kombino Ispelo + Emakso estas por mi la
plej oportuna. Ĝi estas la plej diversflanka kaj ebligas egale facile
redakti kaj tekstojn tajpecajn (ekz‑e retpoŝtajn), kaj la
tipografiajn.


# Piednotoj

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <span lang="fr">Pythoud, Christophe. Français-GUTenberg : un nouveau dictionnaire français pour ISPELL.
Problèmes résolus et intégration de contributions extérieures.
[Cahiers GUTenberg, № 28-29 (1998), pp. 252–275](http://www.numdam.org/item/CG_1998___28-29_252_0.pdf).</span>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> Peeraerts, Paul. [Pri „esperantlingvaj” kaj aliaj citiloj](http://www.ipernity.com/blog/paul_peeraerts/4617856). Ipernity, 2016-06-05.

<sup><a id="fn.3" href="#fnr.3">3</a></sup> “Single guillemets may be used for quotes inside quotes.” 
Unicode® Standard 15.1.0 (2023 Sept. 12). [Chapter 6](https://www.unicode.org/versions/Unicode15.0.0/ch06.pdf), p. 272.

<sup><a id="fn.4" href="#fnr.4">4</a></sup> Wennergren, Bertilo. [Bazformoj de radikoj en vortaroj](http://interlingvistiko.net/wp-content/uploads/2021/05/2-Wennergren.-Bazformoj-de-radikoj-en-vortaroj.pdf).
Esperantologio / Esperanto Studies, **4** (2009), p. 17.

<sup><a id="fn.5" href="#fnr.5">5</a></sup> Turgenev I.S., tradukis Kabe. [Patroj kaj filoj](https://books.google.ru/books?id=sJstAQAAMAAJ). Librejo
«Esperanto», Moskvo, 1909. Ĉap. 17ª, p. 77.

<sup><a id="fn.6" href="#fnr.6">6</a></sup> Johán Valano: [Tien](https://legacy.esperanto.org.uk/eldonoj/piron/tekstoj/Tien.html). Vieno: IEM, 1997.

<sup><a id="fn.7" href="#fnr.7">7</a></sup> Dickens, Charles trad. Zamenhof, L. La batalo de lʼ vivo.
«La Esperantisto», vol. 2 (1891, feb.–jul. kaj sep.–nov.).

<sup><a id="fn.8" href="#fnr.8">8</a></sup> I. Turgenjev, tradukis Kabe. Patroj kaj filoj. Inko Tyresö, 2001.

<sup><a id="fn.9" href="#fnr.9">9</a></sup> Unicode® Standard 15.1.0 (2023 Sept. 12). [Chapter 6](https://www.unicode.org/versions/Unicode15.0.0/ch06.pdf).

<sup><a id="fn.10" href="#fnr.10">10</a></sup> Unicode Data [UDC.txt](https://www.unicode.org/Public/UCD/latest/ucd/UnicodeData.txt).

<sup><a id="fn.11" href="#fnr.11">11</a></sup> Pri ĝia nevalido eĉ por la angla lingvo vidu la blogaĵon
“[Which Unicode character should represent the English apostrophe? (And why the Unicode committee is very wrong)](https://tedclancy.wordpress.com/2015/06/03/which-unicode-character-should-represent-the-english-apostrophe-and-why-the-unicode-committee-is-very-wrong)” kaj la postan diskuton tie.

<sup><a id="fn.12" href="#fnr.12">12</a></sup> Similcele ISO rekomendas 2 [Multlingvajn Eŭropajn Subarojn](https://en.wikipedia.org/wiki/Unicode#Standardized_subsets)
(MES) de Unikodo: [MES-1](https://www.cl.cam.ac.uk/~mgk25/ucs/mes-1-rationale.html) (por la latinaflabetaj skribsistemoj, 335
signoj) kaj MES-2 (por la alfabetoj latinaj, greka, cirilaj, 1062
signoj). Ambaŭ entenas kaj la literan apostrofon U+02BC, kaj la
citilon U+2019. (WGL4 situas meze: 657 signoj, kvankam ne ĉiujn
signifojn de MES-1 ĝi disponigas.)

<sup><a id="fn.13" href="#fnr.13">13</a></sup> Ekzamenante la tiparojn mi rimarkis, ke la kutima testfrazo
pri la signoj speciale Esperantaj estas nekompleta, kaj mi jene ĝin
ŝanĝis: `Eĥoŝanĝʼ ĉiuĵaŭde` (por testi ankaŭ la literan apostrofon).
